# Data frame is tabular structure very similar to spreadsheets
# Handles multi-dimenstional data
# Consists of an ordered collection of columns each of which contains a value of different type

>>Data Frame Consisting Of Attributes And Methods
index     colour  object  price
  0         Red     Car    1000
  1        Yellow   Van    2000
  2        Green    Bus    2500
  3        Orange   Toy    100
  4        Blue    Table   1000

In [1]:
import pandas as p
data = {"Calorie": [420,380,390], "Duration":[50,40,45]}
df = p.DataFrame(data)
df

   Calorie  Duration
0      420        50
1      380        40
2      390        45

In [3]:
# write a python program with 3 attributes(Colour, Object, Price)
a = {"Colour":["Blue", "Green", "Yellow", "Red", "White"], "Object":["Ball", "Pen", "Pencil", "Paper", "Mug"], "Price":[1.2, 1.0, 0.6, 0.9, 1.7]}
af = p.DataFrame(a)
af

   Colour  Object  Price
0    Blue    Ball    1.2
1   Green     Pen    1.0
2  Yellow  Pencil    0.6
3     Red   Paper    0.9
4   White     Mug    1.7

CREATE A DATA FRAME FROM LISTS

In [5]:
#Eg 1:
data = [1,2,3,4,5]
df = p.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [10]:
#Eg 2:
data = [["Alex", 10], ["Bob",12], ["Dark", 13]]
df = p.DataFrame(data, columns = ["Name", "Age"])
df

   Name  Age
0  Alex   10
1   Bob   12
2  Dark   13

CREATE A DATA FRAME FROM DICTIONARY

In [24]:
# Eg 1:
data = {"Name":["Tom", "Jack", "Steve", "Ricky"], "Age":[28,34,29,42]}
df = p.DataFrame(data, index = ["Rank 1","Rank 2", "Rank 3", "Rank 4"])
df

         Name  Age
Rank 1    Tom   28
Rank 2   Jack   34
Rank 3  Steve   29
Rank 4  Ricky   42

CREATE A DATA FRAME FROM LIST OF DICTIONARIES

In [17]:
data = [{'a':1, 'b':2}, {'a':5, 'b':10,'c':20}]
df = p.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [19]:
data = [{'a':1, 'b':2, 'c':3}, {'a':5, 'b':10}]
df = p.DataFrame(data, index = ["First", "Second"])
df

        a   b    c
First   1   2  3.0
Second  5  10  NaN